Repository: AMDmi3/SMC
Catalog: smc/data/translations/*.po
Languages: pl, zh_tw

source: Filename
pl: Nazwa pliku
zh_tw: 檔案名稱

source: Sound filename
pl: Nazwa pliku dźwiękowego
zh_tw: 聲音檔案名稱

source: Continuous
pl: Ciągły
zh_tw: 連續

source: Check if the sound should be played continuously instead of randomly
pl: Zaznacz, jeśli dźwięk ma być odtwarzany ciągle zamiast losowo
zh_tw: 檢查聲音是否持續播放而不是隨機播放

source: Delay Minimum
pl: Opóźnienie minimalne
zh_tw: 延遲最小值

source: Minimal delay until played again
pl: Minimalne opóźnienie przed ponownym odtwarzaniem
zh_tw: 最小的延遲直到在播放

source: Maximum
pl: Maksymalne
zh_tw: 最大值

source: Maximal delay until played again
pl: Maksymalne opóźnienie przed ponownym odtwarzaniem
zh_tw: 最大的延遲直到再次播放

source: Volume Minimum
pl: Głośność minimalna
zh_tw: 最小音量

source: Minimal random volume for each play
pl: Minimalna losowa głośność dla każdego odtworzenia
zh_tw: 播放最小隨機的聲音

source: Maximal random volume for each play
pl: Maksymalna losowa głośność dla każdego odtworzenia
zh_tw: 播放最大隨機的聲音

source: Volume Reduction Begin
pl: Początek redukcji głośności
zh_tw: 音量開始減低

source: Volume reduction begins gradually at this distance
pl: Redukcja głośności rozpoczyna się stopniowo od tego momentu
zh_tw: 音量在這個距離開始逐漸減低

source: End
pl: Koniec
zh_tw: 結束

source: Volume reduction ends at this distance. Sound is not played beyond this.
pl: Redukcja głośności kończy się w tym momencie. Poza tym punktem dźwięk nie jest odtwarzany.
zh_tw: 音量在這個距離結束。聲音不再播放。

source: Loading
pl: Ładuję
zh_tw: 載入中

source: Editor enabled
pl: Edytor aktywny
zh_tw: 可以編輯

source: Loading Level failed :
pl: Ładowanie poziomu nieudane :
zh_tw: 載入等級失敗：

source: Loading Images
pl: Ładuję obrazy
zh_tw: 圖像載入中

source: Loading Sounds
pl: Ładuję dźwięki
zh_tw: 音效載入中

source: undefined
pl: niezdefiniowany
zh_tw: 未定

source: left
pl: w lewo
zh_tw: 左

source: right
pl: w prawo
zh_tw: 右

source: up
pl: w górę
zh_tw: 上

source: down
pl: w dół
zh_tw: 下

source: top_left
pl: górny_lewy
zh_tw: 左上

source: top_right
pl: górny_prawy
zh_tw: 右上

source: bottom_left
pl: dolny_lewy
zh_tw: 左下

source: bottom_right
pl: dolny_prawy
zh_tw: 右下

source: left_top
pl: lewy_górny
zh_tw: 左上

source: left_bottom
pl: lewy_dolny
zh_tw: 左下

source: right_top
pl: prawy_górny
zh_tw: 右上

source: right_bottom
pl: prawy_dolny
zh_tw: 右下

source: horizontal
pl: poziomo
zh_tw: 橫的

source: vertical
pl: pionowo
zh_tw: 直的

source: all
pl: wszystkie
zh_tw: 全部

source: first
pl: pierwszy
zh_tw: 最初的

source: last
pl: ostatni
zh_tw: 最後的

source: green
pl: zielony
zh_tw: 綠色

source: default
pl: domyślny
zh_tw: 預設

source: white
pl: biały
zh_tw: 白色

source: black
pl: czarny
zh_tw: 黑色

source: red
pl: czerwony
zh_tw: 紅色

source: orange
pl: pomarańczowy
zh_tw: 橘色

source: yellow
pl: żółty
zh_tw: 黃色

source: blue
pl: niebieski
zh_tw: 藍色

source: brown
pl: brązowy
zh_tw: 棕色

source: grey
pl: szary
zh_tw: 灰色

source: Direction
pl: Kierunek
zh_tw: 方向

source: Fly distance
pl: Odległość lotu
zh_tw: 飛行距離

source: Hits
pl: Trafienia
zh_tw: 打擊

source: Hits until a downgrade
pl: Liczba trafień do zmniejszenia
zh_tw: 打擊直到降級

source: Downgrades
pl: Zmniejszenia
zh_tw: 降級

source: Downgrades until death
pl: Liczba zmniejszeń do śmierci
zh_tw: 降級直到死亡

source: Shell Time
pl: Czas muszli
zh_tw: 縮入龜殼時間

source: Time running as shell to rise again
pl: Czas biegania jako muszla do ponownego powstania
zh_tw: 龜殼再次活動的時間

source: Enabled
pl: Aktywne
zh_tw: 啟用

source: Disabled
pl: Nieaktywne
zh_tw: 停用

source: Image directory
pl: Katalog obrazów
zh_tw: 圖像目錄

source: Directory containing the images
pl: Katalog zawierający pliki obrazków
zh_tw: 包含圖像的目錄

source: Distance
pl: Odległość
zh_tw: 距離

source: Movable Distance into its direction
pl: Odległość poruszania w jego kierunku
zh_tw: 到它的方向可移動的距離

source: Speed
pl: Prędkość
zh_tw: 速度

source: Initial speed when jumping out
pl: Początkowa prędkość wyskakiwania
zh_tw: 跳躍時的最初速度

source: Movable distance
pl: Odległość ruchoma
zh_tw: 可移動的距離

source: Always fly
pl: Zawsze lata
zh_tw: 一直飛

source: Move without stopping at the fly distance
pl: Porusza się bez zatrzymywania w zdefiniowanej odległości lotu
zh_tw: 在飛行距離不停移動

source: Wait time
pl: Czas oczekiwania
zh_tw: 等待時間

source: Time to wait until moving again after a stop
pl: Czas oczekiwania zanim ponownie ruszy po zatrzymaniu
zh_tw: 停止之後的等待時間直到下次移動

source: The distance to move each time
pl: Odległość każdorazowego poruszania się
zh_tw: 每次移動的距離

source: Speed when activated
pl: Prędkość, kiedy aktywowany
zh_tw: 啟動時的速度

source: Image
pl: Obraz
zh_tw: 圖像

source: Image filename
pl: Nazwa pliku obrazu
zh_tw: 圖像檔案名稱

source: Rotation Speed
pl: Prędkość obrotowa
zh_tw: 旋轉速度

source: Maximum speed
pl: Maksymalna prędkość
zh_tw: 最高速度

source: Detection distance into its direction
pl: Odległość wykrywania w jego kierunku
zh_tw: 在這方向偵測路程

source: Points %08d
pl: Punkty %08d
zh_tw: 積分 %08d

source: Lives :
pl: Życia :
zh_tw: 命：

source: Time %02d:%02d
pl: Czas %02d:%02d
zh_tw: 時間 %02d:%02d

source: Level
pl: Poziom
zh_tw: 等級

source: Player
pl: Gracz
zh_tw: 玩家

source: FPS : best
pl: FPS : najlepsze
zh_tw: FPS：最好

source: , worst
pl: , najgorsze
zh_tw: , 最差

source: , current
pl: , aktualne
zh_tw: , 目前

source: average
pl: średnie
zh_tw: 平均

source: Camera : X
pl: Kamera : X
zh_tw: 照像：X

source: Name :
pl: Nazwa :
zh_tw: 名字：

source: Objects :
pl: Obiekty :
zh_tw: 物體：

source: Passive :
pl: Pasywne :
zh_tw: 被動的 :

source: Massive :
pl: Masywne :
zh_tw: 實心的：

source: Enemy :
pl: Wróg :
zh_tw: 敵人：

source: Active :
pl: Aktywne :
zh_tw: 主動的：

source: Halfmassive :
pl: Półmasywne :
zh_tw: 半實心的：

source: Moving Platform :
pl: Poruszająca się platforma :
zh_tw: 移動平台 :

source: Goldbox :
pl: Pudło złota :
zh_tw: 金幣盒 :

source: Bonusbox :
pl: Pudło bonusów :
zh_tw: 紅利盒 :

source: Other :
pl: Inne :
zh_tw: 其他：

source: Velocity X
pl: Prędkość X
zh_tw: 速度 X

source: Moving State
pl: Stan poruszania
zh_tw: 移動狀態

source: Ground
pl: Grunt
zh_tw: 地板

source: Game Mode :
pl: Tryb gry :
zh_tw: 遊戲模式 :

source: World :
pl: Świat :
zh_tw: 世界 :

source: Level Settings :
pl: Ustawienia poziomu :
zh_tw: 等級設定 ：

source: Level Layer 1 :
pl: Warstwa poziomu 1 :
zh_tw: 第一層：

source: Level Player :
pl: Gracz poziomu :
zh_tw: 等級玩家 ：

source: Level Layer 2 :
pl: Warstwa poziomu 2 :
zh_tw: 第二層：

source: Level Hud :
pl: HUD poziomu :
zh_tw: 等級抬頭顯示器：

source: Level Editor :
pl: Edytor poziomu :
zh_tw: 等級編輯：

source: Mouse :
pl: Myszka :
zh_tw: 滑鼠：

source: Update
pl: Uaktualnienie
zh_tw: 更新

source: process input :
pl: przetwarza dane :
zh_tw: 程序輸入 ：

source: level :
pl: poziom :
zh_tw: 等級 ：

source: level editor :
pl: edytor poziomu :
zh_tw: 編輯等級：

source: player :
pl: gracz :
zh_tw: 玩家 ：

source: camera :
pl: kamera :
zh_tw: 攝影機：

source: Credits
pl: Napisy
zh_tw: 榮譽

source: Version
pl: Wersja
zh_tw: 版本

source: This will reset your current progress. Continue ?
pl: To spowoduje skasowanie Twoich aktualnych postępów. Kontynuować?

source: Couldn't load overworld
pl: Nie można załadować mapy
zh_tw: 無法讀取超出的世界

source: Couldn't load level
pl: Nie można załadować poziomu
zh_tw: 無法載入等級

source: Delete
pl: Usunąć
zh_tw: 刪除

source: Back
pl: Wstecz
zh_tw: 返回

source: On
pl: Wł
zh_tw: 開

source: Off
pl: Wył
zh_tw: 關

source: Name
pl: Nazwa
zh_tw: 名字

source: Key
pl: Klawisz
zh_tw: 鍵

source: None
pl: Żaden
zh_tw: 無

source: Button
pl: Przycisk
zh_tw: 按鈕

source: Up
pl: Góra
zh_tw: 上

source: Down
pl: Dół
zh_tw: 下

source: Left
pl: Lewy
zh_tw: 左

source: Right
pl: Prawy
zh_tw: 右

source: Jump
pl: Skok
zh_tw: 跳

source: Shoot
pl: Strzał
zh_tw: 發射

source: Item
pl: Przedmiot
zh_tw: 項目

source: Action
pl: Akcja
zh_tw: 動作

source: Exit
pl: Wyjście
zh_tw: 離開

source: Press a key
pl: Naciśnij jakiś klawisz
zh_tw: 按一個鍵

source: Press a button
pl: Naciśnij jakiś przycisk
zh_tw: 按一個鈕

source: for
pl: , żeby
zh_tw: 為

source: . Press ESC to cancel.
pl: . Naciśnij ESC, żeby anulować.
zh_tw: . 按ESC鍵取消.

source: Reinitialization
pl: Inicjuję
zh_tw: 重新初始化

source: Reloading
pl: Przeładowuję
zh_tw: 重新載入中

source: Enabled :
pl: Aktywny :
zh_tw: 啟用：

source: 3000 Points needed for saving in a level. Saving on the Overworld is free.
pl: Potrzeba co najmniej 3000 punktów, żeby można było zapisać wewnątrz poziomu. Zapisywanie na Mapie jest za darmo.
zh_tw: 需要3000點儲存這等級。 在超世界儲存沒有限制。

source: No Description
pl: Brak opisu
zh_tw: 沒有說明

source: Enter Description
pl: Wpisz opis
zh_tw: 輸入說明

source: Halfmassive -
pl: Półmasywne -
zh_tw: 半實心的 -

source: Massive -
pl: Masywne -
zh_tw: 實心的 -

source: Front Passive -
pl: Przednio-pasywne -
zh_tw: 被動掩護 -

source: Passive -
pl: Pasywne -
zh_tw: 被動的 -

source: Climbable -
pl: Wspinaczkowe -
zh_tw: 可攀登的 -

source: Editor Z :
pl: Edytor Z :
zh_tw: 編輯器 Z：

source: Couldn't save level
pl: Nie mógł zapisać poziomu
zh_tw: 無法儲存等級

source: Level
pl: Poziom
zh_tw: 等級

source: saved
pl: zapisany
zh_tw: 儲存

source: Level Editor disabled
pl: Edytor poziomów wyłączony
zh_tw: 等极編輯器停用

source: Create a new Level
pl: Utwórz nowy poziom
zh_tw: 建立一個新等級

source: already exists
pl: już istnieje
zh_tw: 已存在

source: Created
pl: Utworzono
zh_tw: 已建立

source: Load a Level
pl: Załaduj poziom
zh_tw: 載入等級

source: Loaded
pl: Załadowano
zh_tw: 已載入

source: Save
pl: Zapisać
zh_tw: 儲存

source: Save Level as
pl: Zapisz poziom jako
zh_tw: 儲存等級為

source: New name
pl: Nowa nazwa
zh_tw: 新名稱

source: Delete and Unload
pl: Usunąć i skasować
zh_tw: 刪除並卸載

source: Reload Level ?
pl: Załadować ponownie poziom?
zh_tw: 要重新載入等級嗎？

source: Initial direction
pl: Początkowy kierunek
zh_tw: 最初的方向

source: Box Goldpiece Yellow
pl: Pudło Moneta Żółta
zh_tw: 黃色金幣盒

source: Box Goldpiece Red
pl: Pudło Moneta Czerwona
zh_tw: 紅色金幣盒

source: Animation
pl: Animacja
zh_tw: 生(指狀態)

source: Use the Power animation if the box has a good or needed item for this level
pl: Użyj animacji Mocy, jeśli to pudło zawiera dobry albo potrzebny na tym poziomie przedmiot
zh_tw: 如果這盒子有這等級需要的東西使用激勵力量

source: The item that gets spawned
pl: Przedmiot, który się pojawia
zh_tw: 菌種項目

source: Empty
pl: Pusty
zh_tw: 空的

source: Random
pl: Losowy
zh_tw: 隨機

source: Mushroom
pl: Grzybek
zh_tw: 磨菇

source: Fireplant
pl: Ognista roślina
zh_tw: 有火的植物

source: Mushroom Blue
pl: Grzybek Niebieski
zh_tw: 藍蘑菇

source: Mushroom Ghost
pl: Grzybek Duch
zh_tw: 鬼蘑菇

source: Mushroom 1-UP
pl: Grzybek 1-WYŻEJ
zh_tw: 蘑菇 1-UP

source: Star
pl: Gwiazda
zh_tw: 星形勳章

source: Goldpiece
pl: Moneta
zh_tw: 金幣

source: Mushroom Poison
pl: Grzybek Trucizna
zh_tw: 毒蘑菇

source: Force item
pl: Wymuś przedmiot
zh_tw: 強迫項目

source: Force best available item when activated
pl: Wymuś najlepszy dostępny przedmiot, gdy aktywowany
zh_tw: 啟動時強迫最適合的項目

source: Gold color
pl: Złoty kolor
zh_tw: 金色

source: Gold color if the item is a goldpiece
pl: Złoty kolor, jeśli przedmiot jest Monetą
zh_tw: 金幣的項目就呈現金色

source: Useable Count
pl: Licznik użyteczności
zh_tw: 可使用的秒數

source: Invisible
pl: Niewidzialny
zh_tw: 暗藏的

source: Massive is invisible until activated. Ghost is only visible and activateable if in ghost mode. Semi Massive is like Massive but only touchable in the activation direction.
pl: Masywny jest niewidzialny do czasu aktywacji. Duch jest widzialny i aktywowalny tylko, jeśli jest w trybie ducha. Pół-Masywny jest podobny do Masywnego, ale daje się dotknąć tylko w kierunku aktywacji.

source: Massive
pl: Masywny

source: Ghost
pl: Duch
zh_tw: 鬼

source: Semi Massive
pl: Pół-Masywny

source: Invisible
pl: Niewidzialne
zh_tw: 暗藏的

source: Ghost
pl: Duch

source: Enemystopper
pl: Przeszkoda wroga
zh_tw: 敵人阻止者

source: Red Goldpiece
pl: Czerwona Moneta
zh_tw: 紅色金幣

source: Beam
pl: Promień
zh_tw: 光束運送

source: Warp
pl: Zakrzywienie
zh_tw: 扭曲

source: The direction to come out
pl: Kierunek wyjścia
zh_tw: 出現方向

source: Name for identification
pl: Nazwa dla identyfikacji
zh_tw: 辨識用名稱

source: Direction to move in
pl: Kierunek wejścia
zh_tw: 移動的方向

source: Destination Level
pl: Poziom Przeznaczenia
zh_tw: 目標等級

source: Name of the level that should be entered. If empty uses the current level.
pl: Nazwa poziomu, na który się wchodzi. Jeśli nie podana, użyty jest aktualny poziom.
zh_tw: 輸入登入等級名稱。若空白，使用目前等級。

source: Destination Entry
pl: Wejście Przeznaczenia
zh_tw: 通往終點

source: Name of the Entry in the destination level. If empty the entry point is the player start position.
pl: Nazwa Wejścia na poziomie przeznaczenia. Jeśli nie podana, punktem wejścia jest początkowa pozycja gracza.
zh_tw: 在目的等級裡的入口名稱。如果沒有指定，入口是遊戲起點。

source: Touch time
pl: Czas dotknięcia
zh_tw: 觸摸時間

source: Time when touched until shaking starts
pl: Czas od momentu dotknięcia do rozpoczęcia trzęsienia
zh_tw: 觸碰到開始搖動的時間

source: Shake time
pl: Czas trzęsienia
zh_tw: 搖擺時間

source: Time it's shaking until falling
pl: Czas przez jaki się trzęsie zanim spadnie
zh_tw: 從晃動到落下的時間

source: Touch move time
pl: Czas dotknięcie - ruch
zh_tw: 觸碰移動時間

source: If set does not move until this time has elapsed after touched
pl: Jeśli podano, to nie poruszy się zanim ten czas upłynie po dotknięciu
zh_tw: 如果設定，觸摸後無法移動直到時間消逝

source: Hor image count
pl: Poz. liczba obr.
zh_tw: 計算水平圖像

source: Horizontal middle image count
pl: Pozioma liczba środkowych obrazów
zh_tw: 計算水平中間的圖像

source: Image top left
pl: Obraz górny lewy
zh_tw: 圖像左上方

source: Image top middle
pl: Obraz górny środkowy
zh_tw: 圖像上方中間

source: Image top right
pl: Obraz górny prawy
zh_tw: 圖像右上方

source: Falling
pl: Opadająca
zh_tw: 下降的

source: Delayed
pl: Opóźniona
zh_tw: 延誤

source: Moving
pl: Poruszająca się
zh_tw: 移動

source: Platform -
pl: Platforma
zh_tw: 平台 -

source: Mushroom Red
pl: Grzybek Czerwony
zh_tw: 紅蘑菇

source: Moon (3-UP)
pl: Księżyc (3-WYŻEJ)
zh_tw: 月亮 (3-UP)

source: Text
pl: Tekst
zh_tw: 內文

source: Text to display when activated
pl: Tekst do wyświetlenia przy aktywacji
zh_tw: 啟動時要顯示的文

source: Unnamed
pl: Nienazwany
zh_tw: 未命名

source: Couldn't save world description
pl: Nie można zapisać opisu świata
zh_tw: 無法儲存世界說明

source: Couldn't save world
pl: Nie można zapisać świata
zh_tw: 無法儲存世界

source: World
pl: Świat
zh_tw: 世界

source: World Editor disabled
pl: Edytor Świata nieaktywny
zh_tw: 編輯世界停用

source: Create a new World
pl: Utwórz nowy Świat
zh_tw: 建立新世界

source: Load an Overworld
pl: Załaduj Mapę
zh_tw: 載入超世界

source: Reload World ?
pl: Przeładować Świat ?
zh_tw: 重新載入世界

source: Line Start Point
pl: Punkt Początkowy Linii
zh_tw: 劃起點線

source: Line End Point
pl: Punkt Końcowy Linii
zh_tw: 劃終點線

source: Waypoint origin
pl: Początkowy punkt drogi
zh_tw: 原始起點

source: Waypoint
pl: Punkt drogi
zh_tw: 路點

source: Type
pl: Typ
zh_tw: 類型

source: Destination type
pl: Typ przeznaczenia
zh_tw: 目標類型

source: World
pl: Świat
zh_tw: 世界

source: Destination
pl: Przeznaczenie
zh_tw: 目標

source: Backward Direction
pl: Kierunek Wsteczny
zh_tw: 向後

source: Forward Direction
pl: Kierunek Do przodu
zh_tw: 向前

source: Default Access
pl: Domyślny Dostęp
zh_tw: 預設權限

source: Savegame
pl: Zapisana gra
zh_tw: 儲存遊戲

source: loaded
pl: załadowana
zh_tw: 已載入

source: Saved to Slot
pl: Zapisano na Pozycji
zh_tw: 儲存至列表單位

source: - Level
pl: - Poziom
zh_tw: - 等級

source: - Date
pl: - Data
zh_tw: - 日期

source: Position z
pl: Pozycja Z
zh_tw: 位置 z

source: Emitter width
pl: Szerokość emitera
zh_tw: 發射器的寬度

source: Emitter width in which the particles spawn
pl: Szerokość emitera, na jakiej pojawiają się cząstki
zh_tw: 發射器產生微粒的寬度

source: Height
pl: Wysokość
zh_tw: 高度

source: Emitter height in which the particles spawn
pl: Wysokość emitera, na jakiej pojawiają się cząstki
zh_tw: 發射器產生微粒的高度

source: Emitter TTL
pl: Czas życia emitera
zh_tw: 發射器TTL

source: Emitter time to live. Set -1 for infinite.
pl: Czas życia emitera. Ustaw -1, jeśli ma być nieskończony.
zh_tw: 發射生存時間。設定-1是無限。

source: Emitter interval
pl: Interwał emitera
zh_tw: 發射間隔

source: Quota
pl: Przydział
zh_tw: 配額

source: The amount of particles to spawn for an interval
pl: Liczba cząstek pojawiających się na interwał czasu
zh_tw: 在一個間隔中粒子繁殖的數量

source: TTL
pl: Czas życia
zh_tw: 生存時間

source: Velocity
pl: Prędkość
zh_tw: 速度

source: Rotation z
pl: Rotacja Z
zh_tw: 旋轉 z

source: Add direction
pl: Dodaj kierunek
zh_tw: 新增方向

source: Const. rotation z
pl: Stała rotacja Z
zh_tw: 不停的旋轉 z

source: Scale
pl: Skala
zh_tw: 比率

source: Hor gravity
pl: Poz. grawitacja
zh_tw: 水平引力

source: Ver gravity
pl: Pionowa grawitacja
zh_tw: 垂直引力

source: Saving Textures
pl: Zapisuję tekstury
zh_tw: 儲存紋理

source: Restoring Textures
pl: Odtwarzam tekstury
zh_tw: 恢復紋理

source: Caching Images failed : Could not remove old images
pl: Buforowanie obrazów nieudane. Nie można usunąć starych obrazów
zh_tw: 儲存快取圖像失敗：無法移除舊圖像

source: Caching Images
pl: Buforowanie obrazów
zh_tw: 儲存快取圖像

source: Menu :
zh_tw: 選單：

source: hud :
zh_tw: 抬頭顯示器：
